[
  {
    "review_id": "b2505509-efd2-472b-8010-9de2fc768eb4",
    "author": "sarah lane",
    "rating": 2,
    "date": "September 14, 2025",
    "text": "Takes FOREVER to load. I wanted something to make lists and notes and use on the PC without an Android environment. This would be good except I think all the super fancy other stuff makes it top heavy. Trying to write a simple note it just sits there taking forever to load. And I have the newest Samsung phone with a super WIFI connection.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "2e5a5675-a300-43b6-b53d-b2f6a071fa3d",
    "author": "Makayla Wageman (MK)",
    "rating": 5,
    "date": "May 18, 2025",
    "text": "I was looking for goal management software for entirely personal use and while maybe not initially intended for someone like me, this is PERFECT for what I needed! It took me a moment to realize how customizable everything was, yet also really intuitive and I didn't have to look anything up or seek any tutorial. If you're seeking anything like that for yourself I cant recommend this app/site enough. If the free version is not enough for your needs (unlikely) you only need to pay $7 a month",
    "helpful_count": 128,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "17a3c0ea-6434-4ca5-97cb-a99c39ba16ed",
    "author": "Erin Bailey",
    "rating": 3,
    "date": "December 19, 2024",
    "text": "The notifications are still an issue, though the all notifications just saying \"ClickBot\" issue has been resolved. I do not want clickup to use the convo section, but I can only mark each task as \"not a convo\" which is only helpful if it's a repeating task. Also, because it's in the convo section the only quick action available is to reply with \"ok\" - I need to be able to snooze or mark done or anything that might actually help me manage my time.",
    "helpful_count": 10,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "c8dd63f1-158c-4ad0-ad0b-110127875a56",
    "author": "Matt Kendrick",
    "rating": 1,
    "date": "February 3, 2022",
    "text": "What is going on with this mobile app - you guys have made it impossible to match up to an already existing clickup account. I signed up on my PC first, then downloaded the app to my phone. Once the app is open there is no login option; only a button that sends an email to me, and everytime I click that one and only option I get a message that there was a \"problem with email\" and nothing happens. Why not just let existing users login, link their devices and move on?",
    "helpful_count": 30,
    "developer_response_date": "February 4, 2022",
    "developer_response_text": "Hey Matthew! Thanks for the feedback!\n\nWe're sorry you encountered this issue. If there isn't a \"Other Sign On Options' button available at the bottom of the login page after entering your email (a password option will replace the email link verification), please contact us at help@clikckup.com so we can look into this further & find a resolution."
  },
  {
    "review_id": "507a08cd-105a-4f93-8a97-39d6186dce9d",
    "author": "AJ Rhoads",
    "rating": 4,
    "date": "December 20, 2022",
    "text": "I spent the day looking for an app that I can use for free (until I can afford to pay a subscription) that allows me to invite people and share tasks that need done. This app made that very simple with everything I want; task descriptions, subtask, comments, assigning, and much more. I can also access this from my phone, computer(s), and even my Chromebook. I recommend using this instead of waiting for Microsoft to reset a phone number in 30 days.",
    "helpful_count": 8,
    "developer_response_date": "January 6, 2023",
    "developer_response_text": "Hey AJ! Thanks so much for the review. We really appreciate the feedback! 🙌 We're so glad to hear that the app has everything you want. That's music to our ears!🎶 If there ever is anything at all we can do to improve your experience with the app in the future, please let us know at help@clickup.com. Our team is available anytime to help!✨"
  },
  {
    "review_id": "1fd3924a-6541-4f07-b702-204af851c704",
    "author": "Ben",
    "rating": 3,
    "date": "January 1, 2024",
    "text": "I was hoping this would be an Evernote replacement but there are no options to highlight text. I need multicolor highlighting options. Also, you cannot change the color of the text. These seem like very basic features but they are not available with this app. Otherwise, it seems very good and it might work for you, definitely worth trying. Unfortunately for me, my search continues.",
    "helpful_count": 24,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "8e622003-e359-45ed-b027-95b83f5608bb",
    "author": "Kelempiau Kelasi",
    "rating": 1,
    "date": "November 1, 2023",
    "text": "1 year later, same problem: ADD OFFLINE FUNCTIONALITY!! I go to jot down a quick task and I can't because without signal you can't select the list to put it in! Or anything else! This app is useless without a speedy internet connection. Even a completely separate \"offline\" folder that I can use without signal to add and remember things to sort later would be more useful than this brick of junk. And I pay for the web version. It's good. But this mobile app is embarrassing.",
    "helpful_count": 83,
    "developer_response_date": "November 23, 2022",
    "developer_response_text": "Hey there! Thanks so much for the feedback! 🙌 We're definitely working on improving our mobile apps & eventually they'll have near feature parity as our website. In the meantime, please contact us at help@clickup.com so we can help you with our Offline Mode feature. Our Support team is available anytime to help!✨."
  },
  {
    "review_id": "302a4b45-3724-4428-9d33-e8dd6eb54ad0",
    "author": "Jason Q",
    "rating": 2,
    "date": "December 8, 2022",
    "text": "I have used ClickUp for over 1 year. The Clickup desktop experience has been great. Unfortunately, the mobile app is much less so, and is still far from feature parity with the desktop app. For example, ClickUp Desktop has had the LineUp feature for over 2 years now. I use it to highlight my most important tasks. However, the mobile app STILL DOESN'T HAVE IT! It's extremely disappointing to see basic features like LineUp missing from the mobile application.",
    "helpful_count": 76,
    "developer_response_date": "December 14, 2022",
    "developer_response_text": "Hey Jason! Thanks so much for the feedback! ✨ We're definitely working on improving our mobile apps & eventually they'll have near feature parity as our website. Keep track of what's coming next on our mobile roadmap. In the meantime, you can log into ClickUp from the web browser on your mobile device to use/access the LineUp feature. 🌻"
  },
  {
    "review_id": "1faf8404-d654-4ab0-b1ad-15f9df98ba1b",
    "author": "Cecil Williams",
    "rating": 4,
    "date": "July 23, 2021",
    "text": "ClickUp on desktop is, hands down, the best productivity product I've ever used. Even tho it's designed for businesses, it is just as useful for personal use. I've used ClickUp for over a year to manage my personal tasks/goals, my household, and my university classes/career. The reason this isn't 5 stars is because the mobile app is just not as good. I've used the Apple and Android versions, the old app and the newer one. There is a lot of things you can't do on the app, it will frustrate you.",
    "helpful_count": 48,
    "developer_response_date": "July 23, 2021",
    "developer_response_text": "Hey, Cecil! Thank you so much for your review! 😊 We're so glad to hear you're using ClickUp for your own to-do lists! Sorry to hear you're frustrated, but we're constantly working on improving the mobile app, and we know we will with user's feedback like yours! 🚀"
  },
  {
    "review_id": "85d195e6-57c7-4cef-a739-afb3b4fd7f86",
    "author": "April Melchior",
    "rating": 3,
    "date": "November 4, 2021",
    "text": "I really love the desktop app, but the Android app is buggy and isn't adding all scheduled task to the calendars and \"next up\" or \"tomorrow\" tabs. Also, the widget is completely useless. I was hoping the widget would have a few options including a calendar, but it's just a list of \"today\" tasks so you can't even see what you have coming up the following day.",
    "helpful_count": 37,
    "developer_response_date": "November 17, 2021",
    "developer_response_text": "Hey April! Thanks so much for your feedback!\n\nWe're so glad that you love the desktop app! That's music to our ears!\n\nPlease email us at help@clickup.com so we can look into the issues you ran into and offer suggestions that may improve your mobile experience! Our Support team is available 24/7 to help!"
  },
  {
    "review_id": "7f448f95-cff1-4090-8326-2e54f3f96df4",
    "author": "Brenna Wiley",
    "rating": 5,
    "date": "June 2, 2021",
    "text": "I absolutely love ClickUp. I use it to organize home projects as well as school stuff, and the level of organization and the amount of features in it is insane (and kind of overwhelming for a few hours until you start figuring it out). I definitely recommend using it (and make sure to use the desktop version as well, especially when setting things up).",
    "helpful_count": 44,
    "developer_response_date": "June 3, 2021",
    "developer_response_text": "Hey, Brenna! Thanks for the fantastic review! We're so happy to hear that ClickUp is keeping you organized and on track! 🏂"
  },
  {
    "review_id": "c9eebd1b-e8bf-4626-a303-39ee1208a8c5",
    "author": "A Google user",
    "rating": 3,
    "date": "March 6, 2019",
    "text": "To be clear, ClickUp is one of the best task management apps out there and their web version is outstanding, but as others have stated, the mobile version is lacking. Time view is limited, going through each list is slow and a pain. There is a new version coming with ClickUp 2.0 and with the way they have been releasing features in the last year, I'm hopeful it will be great.",
    "helpful_count": 21,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "6716887e-3c2c-4f72-8dab-82a8bb8f02fc",
    "author": "S A",
    "rating": 2,
    "date": "August 17, 2024",
    "text": "I can't find anything assigned to me, nor will it show my favorites on the favorite list, nor can I find anything, period. I can use the search feature but I have to know the exact name of the document to find it, & my \"dashboards\" have never been in the dashboard section, nor do I know how to find them, although they are sent weekly. This app is nothing but stress. It has the potential to be great, but perhaps not the ability.",
    "helpful_count": 11,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "ec540289-bc3c-4f4b-b420-33fcc14b2e86",
    "author": "Aiesha",
    "rating": 2,
    "date": "December 15, 2021",
    "text": "Edit: 2nd time thing Android app, tried before in April 2021 and there's supposedly been bug fixes and improvements since then. But for me, still useless. I can't even add a task! Forces me to choose a list and there's literally nothing there for me to select, so I end up being unable to add a task. The \"roadmap\", which I presume is there to help navigate through the mobile app, leads to a \"nothing here\" page. Ridiculous. Uninstalling AGAIN.",
    "helpful_count": 40,
    "developer_response_date": "December 15, 2021",
    "developer_response_text": "Hey Aiesha! Thank you for the review! We really appreciate your feedback!\n\nWe really want to help! Please email us at help@clickup.com so we can show you how to add a task on the mobile app and offer suggestions that may improve your mobile experience! Our Customer Support team is available 241/7 to assist you!"
  },
  {
    "review_id": "fd4e4f9f-c43c-4e27-a599-8782523d3804",
    "author": "Scott Tilton",
    "rating": 1,
    "date": "March 28, 2021",
    "text": "Not Useable at all. Love the web app, but the app on my phone I can't use. The first day I used it, got logged in, no problems. Next day and since can't even open the app. The clickup logo shows on the screen, and that is all she wrote. Just sits there forever. I have tried rebooting phone, forcing the app closed. Nothing works. Guess will have to stick with just the web app.",
    "helpful_count": 41,
    "developer_response_date": "March 30, 2021",
    "developer_response_text": "Hey, Scott! We were notified that Google recently made an update to Android phones that caused some issues with apps using webview! This has recently been fixed by Google. Can you please make sure that you have updated Chrome and the Android system webview to the latest versions on your phone? Let us know if this helps resolve the issue!"
  },
  {
    "review_id": "5800b67d-6304-45ad-b9f1-ed756992eb84",
    "author": "jo jo",
    "rating": 2,
    "date": "December 26, 2023",
    "text": "ClickUp is a great tool, but the app is not so great. The features on the app are limited, and there is only one widget, which stopped functioning correctly. For my android it no longer recognizes what app to associate with it, so when I click to open either a task or reminder android gives me a list of apps to open the link with, and ClickUp isn't one of them :(",
    "helpful_count": 17,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "41bc2879-7e79-41ab-adb9-48de93b76870",
    "author": "Tomas Catz",
    "rating": 3,
    "date": "February 12, 2022",
    "text": "As new versions have come out, the mobile app has gotten farther and farther from the desktop and web app experience. Many features I use regularly such as subtasks and manual sort order to indicate priorities have gotten harder or impossible to use on mobile. At this point, I pretty much just use this app to stub out tasks in the backlog and have to use a desktop for everything else. Not the end of the world, but not nearly as useful to me.",
    "helpful_count": 28,
    "developer_response_date": "February 17, 2022",
    "developer_response_text": "Hey Tomas! Thanks so much for the feedback! 🤗 We're actively working on improving the mobile apps and eventually they'll have near feature parity as our web app. In the meantime, you can access ClickUp from your mobile device's web browser so that you can use the features the way you'd like.📱"
  },
  {
    "review_id": "3562d68a-afe5-49a1-bf5a-c10d1ded7421",
    "author": "Cato Keito",
    "rating": 3,
    "date": "June 25, 2021",
    "text": "The app has much more limited functionality than the browser version, and it's a bit disappointing that I can't reorder subtasks or create recurring due dates, but it's good enough. I'm posting because I don't see how to contact support through the app to report the issue with Docs. The behavior of the Docs feature is so poor, it's basically not useable for anything other than typing paragraphs. If I use enter, heading, paste, undo, or otherwise try to edit my text, text moves or disappears. 😕",
    "helpful_count": 7,
    "developer_response_date": "June 25, 2021",
    "developer_response_text": "Hey, Keito! Thanks for the review! Eventually, the new app will have near feature parity with our web app, but with all the dynamic features we've built it will take time. Be sure to checkout our mobile roadmap for more information. Also, can you send us an email to help@clickup.com for your issue with Docs? We'd love to look into this!🕵🏻‍♂️"
  },
  {
    "review_id": "76d1081f-e986-491d-b4c2-b3c7c4e3fe20",
    "author": "Andrew Hansen",
    "rating": 5,
    "date": "September 25, 2021",
    "text": "EDIT: ClickUp has offline mode now for all platforms, and it also saves all tasks in the task tray (in desktop mode) offline. I emailed their support team and was very impressed with their fast and helpful response! The mobile app is still missing some important features, but this new update adds a lot more. It's also an excellent companion to the full-featured desktop version on the web. It's great for adding tasks and reminders on the go.",
    "helpful_count": 87,
    "developer_response_date": "September 28, 2021",
    "developer_response_text": "Hey, Andie! Thanks so much for the updated review! We're so glad that you were impressed with our support team & that they we're able to help! 😊 The mobile app will continue to be refined. Our goal in the next year is to develop the app with the same capabilities as our web app. You can keep track of what's coming next on our mobile roadmap!🚀"
  },
  {
    "review_id": "d44c1a9d-4e90-448f-aa46-b001e6e0d24b",
    "author": "Tom Haight",
    "rating": 3,
    "date": "May 13, 2024",
    "text": "It's feature rich and looks nice on screen, but it leaves a lot to be desired behind the screens and has useless support. The person I talked to knew less than me about the product, and the issue is STILL unresolved. Also, the import from Notion is not worth the effort. Of 49 Notion entities, not a single one was usable after import. They were a mess, and they weren't even complicated. I won't be using the product at all. It doesn't seem worth the time to get proficient using it.",
    "helpful_count": 13,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "45848cfb-67ed-43f0-8ea0-18db9236b41c",
    "author": "Jonathan Noorman",
    "rating": 3,
    "date": "January 18, 2022",
    "text": "The program is great on PC but the app lacks some things. You cannot look at forms or docs in the app. You also cannot enter addresses which is crazy. You cannot set a default startup page. The calendar view very often doesn't load or like right now, shows nothing. I use it for my main calendar and this is frustrating. It also desperately needs to have a caching ability to load the latest data and keep it in memory for offline use. Useless app without cell service.",
    "helpful_count": 15,
    "developer_response_date": "January 20, 2022",
    "developer_response_text": "Hey Jonathan! Thanks for the review!\n\nWe're definitely working on improving our mobile app & eventually it'll have near feature parity as our web app. In the meantime, please contact us at help@clickup.com so we can look into the loading issues you ran into and so we can offer suggestions that may improve your mobile experience."
  },
  {
    "review_id": "9acf709a-c9fe-403c-940c-322d999bd80b",
    "author": "Osmond K",
    "rating": 1,
    "date": "September 24, 2022",
    "text": "Overall it is a good app. However, I keep turning on column on the Gantt view and they stubbornly keep disappearing. Worst of all \"Reschedule dependencies\" almost always turns itself off. I have many Gantt's and before I do anything, I have to add columns and turn on reschedule dependencies. What a nightmare... I am getting to be fed up with this. I reached out to help a couple of days ago, so far nobody has gotten back...",
    "helpful_count": 36,
    "developer_response_date": "September 30, 2022",
    "developer_response_text": "Hey Osmond! Thanks for letting us know! 💫 We truly apologize for any inconvenience this issue & our delayed response has caused. We've recently had a higher than usual influx of customer inquiries, which has temporarily slowed down our response time. However, we're eager to get to look into this issue & find a resolution. ✨"
  },
  {
    "review_id": "c1f56d96-0525-44f4-b2c6-d20103264ca3",
    "author": "Daryl Allison",
    "rating": 3,
    "date": "July 11, 2022",
    "text": "ClickUp is incredibly feature rich. The mobile app is extremely packed to allow this robust tool work on your phone. Do not begin your ClickUp journey here. Get onto your desktop, watch some videos, learn the tool there, then discover how to make the mobile version extend your use of the tool. I'm a power user on the desktop. The mobile app is still surprisingly flawed, including its bug reporting function. I highly recommend the desktop version, but for now beware on mobile.",
    "helpful_count": 40,
    "developer_response_date": "July 28, 2022",
    "developer_response_text": "Hey Daryl! Thank you for the feedback!🌻 We're definitely working on improving our mobile apps & eventually they'll have near feature parity as our website. Keep track of what's coming next on our mobile roadmap. In the meantime, logging into ClickUp from the web browser on your mobile device may improve your mobile experience. 💫"
  },
  {
    "review_id": "d54c6c64-3d39-4f46-bd2e-9a5cf71ba9e5",
    "author": "Ruth",
    "rating": 1,
    "date": "January 16, 2024",
    "text": "The app is terrible. The interface is not clean or organized. I tried to use one of their templates and you can't use it on the app, you have to log in to the browser. So I did & it kept downloading the wrong template. Finally I found another one I liked but it would not let me edit it. If you just want to be organized for your personal life, notion's app has a nicer interface and better templates.",
    "helpful_count": 27,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "73d31ada-6b29-4c25-85e3-a09018d53070",
    "author": "Hannah Kennedy",
    "rating": 1,
    "date": "February 7, 2022",
    "text": "I tried to sign up on the website but it \"took too long to respond\" so I tried signing up on the app. After typing in my email multiple times, I finally got an email. After clicking the link and filling out my information, the submit button would not work. I closed the app and went through everything again but when I hit submit, it came up with an error. I clicked the button again and it said password already exists. If that means my account was created, it won't let me log in anywhere.",
    "helpful_count": 14,
    "developer_response_date": "February 11, 2022",
    "developer_response_text": "Hey Hannah! Thank you very much for the feedback! 🙌 We're sorry to hear that you experienced that issue. Please contact us at help@clickup.com so we can look into that issue and find a resolution. Our Support team is available around the clock to help!✨"
  },
  {
    "review_id": "b3ec693a-769e-4c93-90de-3fd7c3ad9416",
    "author": "jthomas kay",
    "rating": 1,
    "date": "September 2, 2024",
    "text": "This could be a great app, but it's not. I have only one of my Spaces available to me at the moment. Tried to reinstall. Did not work. I can only access via my favorites. -Can't drag and drop subtasks. -Overdue does not work in mobile, so it is tough to know what tasks are actually Overdue, at least with the function that is supposed to tell you. Instead, we see random dates, not in order by date.",
    "helpful_count": 62,
    "developer_response_date": "September 10, 2021",
    "developer_response_text": "Hey there! Thanks for taking the time to leave your feedback! ✨ The new app was released with a limited set of core features to get them into your hands faster & eventually it'll have near feature parity with our web app!📱 In the meantime, please email us at help@clickup.com so we share a couple options that may improve your mobile experience.🤗"
  },
  {
    "review_id": "ad76b5fd-471d-4efb-852c-dddc154a76bf",
    "author": "Nathan Essex",
    "rating": 2,
    "date": "January 2, 2025",
    "text": "I love the web app but mobile is buggy. Sometimes I can't open folders, other times I can't create tasks. Updates from the web can take a while to sync and I don't really like how the calendar looks. I want to make tasks and take notes on the fly so I don't have to use multiple apps and avoid double dictation. But the app really just acts like a fancy to do list where I can check things off and not much else reliably.",
    "helpful_count": 15,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "d039ebb9-9b11-4278-ab19-c48558975537",
    "author": "Gorboduc",
    "rating": 2,
    "date": "March 12, 2021",
    "text": "After the most OBNOXIOUS onboarding experience of Gestapo-like marketing interrogation - during which I lied about every question because it didn't allow me to tell the truth - the app ballooned to over 75 megs in under five minutes, and I still hadn't entered a single task. This is because all I got was 10 min of pulsating purple circles indicating that something, I know not what, was downloading at glacial speed. Tried the web interface but on a phone it's unreadable. Prompt unsubscribe.",
    "helpful_count": 3,
    "developer_response_date": "March 12, 2021",
    "developer_response_text": "Hey, there! Oh on! We're sorry to hear you're having trouble with our new mobile app! We'd love to learn more about what you're experiencing with the speed and curious to see what you mean by the onboarding section! Could you please write to help@clickup.com with some screenshots or video recordings? This would be super helpful!"
  },
  {
    "review_id": "31e61b49-ef8e-457b-8dbb-afd538951e05",
    "author": "Jermey Matthews",
    "rating": 2,
    "date": "March 13, 2021",
    "text": "The way I felt about Gmail in 2003 is the way I feel about ClickUp now. They might very well change the game. However, they might very well be Springpad, which had more and better features than Evernote, but we all know who won. The ClickUp Android app is a joke. The web app is great; make people use that until you can get this one right.",
    "helpful_count": 2,
    "developer_response_date": "March 13, 2021",
    "developer_response_text": "Hey, there! We really appreciate the time you've taken to share your experience with us! We'd love to chat with you further! Could you please write to product@clickup.com? We'd love to set up an interview! We look forward to hearing from you! 😄"
  },
  {
    "review_id": "77622ae6-1018-410f-8b65-19aca8ad1d24",
    "author": "Leah Oliver",
    "rating": 5,
    "date": "January 27, 2022",
    "text": "I love ClickUp. It's been working great for me for at least 5 months. The Android app is usually fine. Currently sharing something to the app to create at tZk isn't available, something with the latest update I guess. One thing I'd like to see is the ability to copy the email address for a list or task so I can send updates and tasks that way.",
    "helpful_count": 17,
    "developer_response_date": "February 1, 2022",
    "developer_response_text": "Hey Leah! Thanks for the review!\n\nWe're so glad to hear that you love ClickUp & we really want to help with the task creating problem you encountered. Please contact us at help@clickup.com so we can look into that & try to find a resolution. Feel free to add any suggestions to our feedback boards, that's the best way for your idea to be considered!"
  },
  {
    "review_id": "52879e0b-c0ff-467a-aa41-f59d9289d1b0",
    "author": "Content by LB",
    "rating": 1,
    "date": "August 13, 2024",
    "text": "The app is horrible. The new updates are horrible. You can't see who assigns tasks anymore it just says \"User assigned\" \"user commented\". When you're in the app you can't tag anyone specific in the comments. I'll go in the following day and see I've missed 20 tasks that were due yesterday when none of them were showing up yesterday.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "b44f5d35-f7fa-407d-93da-eb2ff0619cb3",
    "author": "KYLER HOLLAND",
    "rating": 1,
    "date": "July 30, 2023",
    "text": "Completely disappointed. I LOVED everything about ClickUp. Now, using it full time with work as well as personal and there is NO LANDSCAPE MODE for Android or tablets. This is such a simple ask that has been a feature request for 3 YEARS! I'm beyond frustrated. Unable to actually use tablets as intended. How do we mainly use clickup on the computer? LANDSCAPE. Please update to allow support for Android.",
    "helpful_count": 8,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "6f95bd5b-2d30-4b56-81d9-02d46bc587b3",
    "author": "Mike Shick",
    "rating": 1,
    "date": "December 24, 2024",
    "text": "This app is horrid. For any reasonable access to info inserted using desktop app, it's simply unusable and content cannot be accessed. For instance, if I want to search for comments in my project or tasks, I cannot. I put valuable project data in there and need access in the field on my mobile device. We'll, just use the web version then, albeit very difficult to manage on a phone, but the app will not let you see use the web app. The installed app steels the effort. So basically, it stinks.",
    "helpful_count": 16,
    "developer_response_date": "August 13, 2022",
    "developer_response_text": "Hey Mike! Thanks for the feedback! 🙌 Please contact us at help@clickup.com so we can find a resolution for the issues you encountered and offer suggestions that may improve your experience. Our Support team is available anytime to help!✨"
  },
  {
    "review_id": "b98063f5-6968-4202-9c5e-7185788d11bc",
    "author": "Brandon Bosco",
    "rating": 1,
    "date": "August 7, 2024",
    "text": "Please, im begging you, just fix the add task widget. It has been on and off broken for YEARS. Right now it spawns 2-3 duplicate \"add task\" trays, none of which are defaulted to my last used list. Then once I get the extra trays closed and the correct list selected, it fails to save the task anyway. All I want is to press a button and be able to create a task in the same list every time. That's it. I don't get why this is still an issue.",
    "helpful_count": 23,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "915a4fe6-d09e-4261-8761-b089761d699b",
    "author": "Rahshel Brown",
    "rating": 1,
    "date": "October 26, 2024",
    "text": "They keep updating the app and somehow it keeps getting worse. I just need to see my tasks in order of due date, now that doesn't even work well. How is it showing me tasks due in October before tasks due in September, and all of that shown before tasks still due in August?! This is very simple, stop making it hard. Update: and it just keeps getting worse 🙃 I'm just going to look for a new app at this point",
    "helpful_count": 109,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "0cd95dea-af98-4729-85c1-2aa7154d261f",
    "author": "S Soltani",
    "rating": 1,
    "date": "September 15, 2025",
    "text": "App login doesn't work when MFA is on. I wonder if they have ever tested their app! It asks you to enter your email and password, and then it asks you to enter the Authentication code. You switch to the Authenticator app to see the code and you switch back to ClickUp to enter the code. It will then close the browser and go back to ClickUp, but then nothing happens and it shows you the login page again.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "409efbe4-f093-42a7-a98d-a5d6bbacdcad",
    "author": "Vic Brown",
    "rating": 1,
    "date": "July 9, 2025",
    "text": "ClickUp works really well on my PC but when I go to add a task on my to-do list from the ClickUp mobile app, a pop up says \"status missing\" and will not let me save the task. There does not appear to be an option to \"add the required status\". I am using Samsung Galaxy S24+. Please can you fix this bug?",
    "helpful_count": 8,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "cfa72709-985e-4672-8450-d78ddc31dee2",
    "author": "Jovana Kizovska",
    "rating": 1,
    "date": "September 21, 2025",
    "text": "- customer support 0 - app keeps rearranging my fields in the tasks, also 0 - automation emails now share my location without permission, also 0 - im forced to use it cause of my employer, otherwise 0/10 - it used to be an amazing application up until last year, its sad and disappointing. edit: i contacted CS, no help at all, i keep telling them i have sensitive info and they keep asking for screenshots/screen recordings. dissapointed.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "3af71979-1a2e-4a5c-8478-01a632d7b96b",
    "author": "Charlie Morton",
    "rating": 2,
    "date": "September 8, 2025",
    "text": "I'm grateful for Clickup but am also always amazed at how convoluted the interface is! It needs to be much simpler how to find your tasks quickly. Even in 'Recents' - assignments I've been given simply don't show up. Please make the design simpler for us to find our own tasks quickly and easily. Thank you.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "727bd7f5-ce6a-47ee-9b34-16508e721d86",
    "author": "Mola Diver",
    "rating": 1,
    "date": "August 28, 2025",
    "text": "So far this app is pretty useless. Tickets, threads and other screens always show up empty, also when I open from a notification. *** Fast forward one year. still doesn't work and I can't change my password inside the app from a change password link in my email because I get a big red API error message. Uninstalled for the 4th time now.",
    "helpful_count": 5,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "2ea6365a-fa73-4b28-b9af-feea5bc8b35e",
    "author": "Patt Angels",
    "rating": 1,
    "date": "August 17, 2025",
    "text": "It's terrible. I downloaded the app to help me work on my personal goals, but it's unintuitive, and I've never managed to create a single goal. The interface is overly complicated. Additionally, the desktop version does not sync with the app, so I can't see my goals on my phone. It reminds me of QuickBooks—also overcomplicated and not intuitive at all. I suppose this product is designed for large companies with big teams, not for personal use.",
    "helpful_count": 4,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "4d97ee5a-28ba-4c8d-988b-86ca739db624",
    "author": "Bully Maguire",
    "rating": 3,
    "date": "September 13, 2025",
    "text": "I think this app is good, but I have found a problem while running this app. When I wanted to edit descriptions or docs, the loading was too long. It's a massive problem because I cannot input my progress easily. I will edit my review after the problem is solved. thanks",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "72261587-878f-4fb9-8c88-94990b44fd4b",
    "author": "Abraham Brookes",
    "rating": 2,
    "date": "September 4, 2025",
    "text": "app doesn't work on my phone it just sits there loading the home page. on the spaces page it says create a new space and I do and it doesn't show on the list, just keeps saying create a new space, I add a list and it doesn't show anywhere, I know clickup is a good platform, have used it before so I assume there is something out of the ordinary here however the app is actually not usable on my phone",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "960cfedf-a86b-4922-a32e-14ca454dd297",
    "author": "Amitabh Sharma",
    "rating": 1,
    "date": "July 19, 2025",
    "text": "I am not able to explore anything because of the following issues 1. After logging in the app just keeps on loading the welcome page. 2. Even after downloading the app version it continuously loads the web app version and asks to log in again.",
    "helpful_count": 8,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "3940aef5-af6c-471d-a2ef-420042ab6f93",
    "author": "Rockridge",
    "rating": 1,
    "date": "September 5, 2025",
    "text": "I shared a space and it worked. I refreshed the page on the second account and it disappeared. I attempted to share it again and it doesn't show for the second account. I checked all privacy settings and permissions as per the chat bot. It still doesn't show the space on the second account.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "6947af00-6e62-42ed-bb31-2e41d91acf18",
    "author": "Ben Holland",
    "rating": 3,
    "date": "July 29, 2025",
    "text": "I quite like clickup, and the app has come a long way since the relaunch, but it's still very much just \"ok\". The app does a good job of packing in a ton of featues, but the UX hasn't been adapted for the phone well, and it really suffers for it. In particular I find the inability to swipe to dismiss ( or drag in board views ) incredibly frustrating. It doesn't help that the performance isnt very good either. Still better, but how long has it been since launch now?",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "e0da59d5-ff0e-4015-914b-dc129988bb8a",
    "author": "Hasin Ahmed",
    "rating": 5,
    "date": "September 19, 2025",
    "text": "I saw a guy using it in a restaurant, so I came home and installed it. At first glance, it looked like something you’d have to pay for, but then I realized it’s a hidden gem. As a student from a third world country who can’t afford premium apps to manage my tasks, I find it absolutely amazing.",
    "helpful_count": 9,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "0fb2019f-3a25-4294-a408-34b9ccc53669",
    "author": "Caleb Frow",
    "rating": 3,
    "date": "August 31, 2025",
    "text": "The app has a lot of great functionality. There are quite a few clunky things about it though. The options for notifications are frustratingly scarce. In fact I still can't figure out a way to not receive a notification for every single update someone makes to my team's page. The UI also needs a lot of cleanup.",
    "helpful_count": 4,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "2311fedf-c022-4a2d-8e67-fb0a75b14998",
    "author": "Austin Devore",
    "rating": 1,
    "date": "August 5, 2025",
    "text": "desktop version is amazing. mobile version is absolute dog water of an app. offline mode is anything BUT HELPFUL. horrendous loading times. and no, its not my phone, and the app doesnt need an update. well, it does but for performance issues. thank you in advance for fixing the mobile version",
    "helpful_count": 4,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "3a0b6aa0-5c71-40f2-aaca-f63d4d8f120f",
    "author": "Júlio César Tavares Primo",
    "rating": 1,
    "date": "September 24, 2025",
    "text": "the mobile version is still so far from the quality of the web version. i can't set the recur on tasks, simply it doesn't show any option (daily, weekly, monthly,...)",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "6da1873a-05eb-4654-9e0e-43f6ff1620ff",
    "author": "Moonrain Stars",
    "rating": 5,
    "date": "July 20, 2025",
    "text": "As someone with ADD, diagnosed at 52, this is the one plataform that is really working for me and helps me to really organize my work and personal life. Very flexible and easy to use. I love the option to create my own columns for tasks and be able to place my own estimated times for each task, create subtasks and create multiple microsteps, as these strategies work best for me to keep on task. Be able to receive notification on my mobile is a game changer to not forget what I need to do!!",
    "helpful_count": 23,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "96030a22-a19b-4de5-a927-4c1dbf2c9338",
    "author": "Sathish Palanisamy",
    "rating": 2,
    "date": "July 7, 2025",
    "text": "Can't use more than one account! User have to logout and login everytime to switch between accounts. They could have easily enabled App Clone features which is supported by the Android itself.",
    "helpful_count": 3,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "0a6553da-21a5-41da-a34c-70c4ebae5296",
    "author": "Tina Shaw",
    "rating": 1,
    "date": "August 14, 2025",
    "text": "Fresh install of app won't even launch - just hangs at the opening screen and doesn't load, despite reinstalling and clearing data/cache (per their troubleshooting). Can't even launch app to truly review usage.",
    "helpful_count": 3,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "be61721b-53ab-49df-85bb-fcfabdde253b",
    "author": "kelvin clark",
    "rating": 1,
    "date": "August 25, 2025",
    "text": "Terrible mobile app experience. Messages take very long to load and reflect in the mobile app. I always have to clear storage and sign in again or wait for a long while before I see new messages reflected in the app.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "7c7ff303-5cba-43ab-bcc4-209e5a68a20f",
    "author": "Justin Winger",
    "rating": 2,
    "date": "July 22, 2025",
    "text": "It's pretty, but it railroads you into certain minimal views and it isn't customizable. It's really difficult to use. But it looks good!",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "c8a28836-bd40-4e41-9975-0121f5c6875e",
    "author": "Omri Levin",
    "rating": 5,
    "date": "September 10, 2025",
    "text": "Easily the best tool I have ever tried, it's vast in features yet not imposing, I keep finding awesome features I was not aware of, I even reported a bug yesterday and the story team immediately responded. this tool leaves the competition way behind. SUPER!",
    "helpful_count": 5,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "3ed71d15-9f32-437c-a963-ddf8a9951bc4",
    "author": "Umer Farooq",
    "rating": 5,
    "date": "July 9, 2025",
    "text": "This tool has been incredibly helpful in tracking my progress and managing both my products and time efficiently. I highly recommend it to anyone looking to stay organized and boost productivity.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "a24ba73d-be1e-49b6-a09b-f95f59b55a45",
    "author": "Simi",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "We feel misled by the ClickUp team as they charged extra amounts not mentioned in the bill. The explanations from customer support were unclear and disappointing.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "f44b6022-57f1-431b-bb7a-cf269b3a475d",
    "author": "Fedor Lystsov",
    "rating": 1,
    "date": "August 27, 2025",
    "text": "Be aware of dishonest practices to increase subscription prices without notice or choice. The price will go up when it's too costly for you to switch.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "41f55494-ce18-4654-b357-39c8c62df604",
    "author": "Sanjay Manoj",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "I was hit with unexpected extra charges with no clarity in the invoice at all. Totally unfair and disappointing experience with ClickUp.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "0609eb17-93d8-4f67-af7d-e17e5a08edbe",
    "author": "Shubham Rajdhar",
    "rating": 3,
    "date": "July 11, 2025",
    "text": "Great app but as others have mentioned, needs better state management. Completed tasks are still showing incomplete. Lists take time for loading. Many screens do not have a refresh option.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "9db9aa6e-3e63-46cb-a1e8-b53a2474d680",
    "author": "Ashish Upadhyay",
    "rating": 1,
    "date": "August 5, 2025",
    "text": "Doesn't sync my tasks with google calendar. Cannot show my tasks that I created in the app itself in calendar view but has no problem in showing irrelevant events from google calendar. Not to mention the webapp is laggy as hell.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "cad95be5-ebbc-4048-a499-f8dfae47951e",
    "author": "Ali Farsani",
    "rating": 1,
    "date": "August 21, 2025",
    "text": "lying about meeting summarizes and auto-generated points. it is basically a text editor with tabs! OneNote does it a million times better for free",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "5aeead6f-e762-4896-a5a3-357b881a711d",
    "author": "AMADI FAVOUR",
    "rating": 3,
    "date": "July 24, 2025",
    "text": "It's a wonderful app. However, I'll love to know why the app redirects me to a website in chrome. It's an app but runs on chrome. This is just my issue with it.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "f73cb9af-6b03-49ab-bae0-6de2ccb32e51",
    "author": "Edwin Donnelly",
    "rating": 1,
    "date": "August 15, 2025",
    "text": "So difficult to do even basic things. Needs a lot of retirement to be something I could switch to. Decent concept though.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "80304ea7-5eca-4952-9f90-24c33f7ff1d5",
    "author": "OG Xombie",
    "rating": 1,
    "date": "August 19, 2025",
    "text": "I enter my email, click next go to page that ask for the password, enter and then takes me back to the app and the same thing all over again.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "7aaf71b8-9300-4202-84b5-b9e9f6e3679f",
    "author": "bijina sasi",
    "rating": 1,
    "date": "July 29, 2025",
    "text": "As a global firm with multiple branches across the Middle East, we initially trusted ClickUp. However, undisclosed charges and poor customer support have left us deeply disappointed.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "edf39b01-38b6-48e8-a049-aa47b78af0d5",
    "author": "Anu Janardhanan",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "There was no clear invoice provided—just an unexpected demand for payment. Their billing process lacks transparency and needs serious improvement.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "9dc93738-ffc1-439f-8b46-414ed8733f84",
    "author": "Christina Allen",
    "rating": 2,
    "date": "June 29, 2025",
    "text": "It has potential but there is a rather steep learning curve. I couldn't figure out how to set up a kanban board or anything that would allow me to transfer from Trello. a lot of the site requires a desktop to set up. Make it mobile friendly. it's too clunky and doesn't make any sense. if it takes me more than 5 minutes to figure out, I'm going somewhere else.",
    "helpful_count": 6,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "c81e3207-f845-48a6-b00d-559ca5f3ab7d",
    "author": "Darin Beard",
    "rating": 2,
    "date": "May 6, 2025",
    "text": "it's very buggy right now. Sometimes it won't open at all. I have a notification for uploading an image attachment that keeps showing up over and over for days now. restarted phone and it is still showing. about to uninstall it just to stop that. it also is clunky to use. not intuitive at all. it's not measuring up to the site at all.",
    "helpful_count": 6,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "06fcb54c-84ea-4ad2-93d7-cb8e93e4ad05",
    "author": "Bajitha Vikas",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "We are a global firm with multiple international branches, and we feel misled by the team. Their billing lacks clarity and the overall handling was highly unprofessional.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "8296809f-e640-4aab-afcc-9f4413cdbc71",
    "author": "Peter Di Giorgio",
    "rating": 4,
    "date": "May 5, 2025",
    "text": "Great Work! I am loving the app. I am very happy over all. I did have an issue with using a Bluetooth keyboard for text entry in the app. The first keyboard press registers but text entry stops once the on-screen keyboard auto-hides. I validated proper function in other apps before posting. Thank you!",
    "helpful_count": 50,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "b4ae0408-6eaa-43ac-975b-5b22be7694f4",
    "author": "SHARAN SARATH",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "We were overcharged without billing clarity. ClickUp locked our account unexpectedly. Very dissatisfied with their support.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "5e01de33-634c-49b5-a4a8-72c0343abf03",
    "author": "Aneesh Swaroop",
    "rating": 5,
    "date": "August 29, 2025",
    "text": "I can't login the app using my professional email id. it always stuck after password submission. it shows successfully login but not redirect to app.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "d7f990cd-b6e0-46b8-9837-2a58e6dc8e94",
    "author": "Gabrielle George",
    "rating": 2,
    "date": "April 12, 2025",
    "text": "I was excited, it seemed great, but I got the app and... maybe I'm just an idiot, but I can't add events to my calendar, which was one of the big catchers to me.. I was excited for the list, task and event tracking and reminders. but I can't add more lists, or edit the list names (they revert back every time). I can't figure out how to add events or tasks to my calendar. Even after going to the support section.. it was useless for the mobile app for me. I'm disappointed. It has potential though",
    "helpful_count": 11,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "c26a6b7b-c6dd-4716-b52e-8d67882551bd",
    "author": "Thomas Niedfeldt",
    "rating": 1,
    "date": "July 2, 2025",
    "text": "I try to open the app and I never make it past the loading screen. Unusable most of the time.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "11d4c19e-8ba4-4014-8f0e-5e5e9726ad32",
    "author": "Aleksandar Janković",
    "rating": 3,
    "date": "June 1, 2025",
    "text": "I'm a ClickUp power user on desktop, where it performs flawlessly. Excellent tool. However this app has several issues: random crashes, slow loading and editing of descriptions and other quirks which make it a step down when coming from Google Keep on mobile.",
    "helpful_count": 3,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "763f5f23-c9ab-425b-867d-c5b65fba593d",
    "author": "Tim Greller",
    "rating": 1,
    "date": "June 17, 2025",
    "text": "Buggy, has sync issues. Especially the \"important\" tab of the inbox doesn't update. And that's the main point of the app imo, so that you can see if there are any urgent inbox items when not at the computer.",
    "helpful_count": 3,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "8820d00d-e079-433c-983b-79ca0bbde5af",
    "author": "Elham Ebrahem",
    "rating": 5,
    "date": "May 9, 2025",
    "text": "ClickUp is seriously a game changer for work! The desktop version is packed with powerful features that make organizing tasks super efficient, while the mobile version is more for quick syncs and updates on the go. I’m honestly impressed by how much this app offers for free—I even made my own custom template using some the most useful tools. It’s literally the best app for teams, just like the rating says. If you’re using the free plan, this is hands down the best work management app out there!",
    "helpful_count": 23,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "070d7239-6059-493e-87d0-287b824d9372",
    "author": "Jason Wissner",
    "rating": 1,
    "date": "August 24, 2025",
    "text": "this app is all too anxious to bill you for trying to be collaborative with no notification or clarity. they even build me for accounts I deleted that are no longer associated my account",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "b4784cb1-d3e7-40de-9e87-fa554f146a4b",
    "author": "Pratamesh Mistry",
    "rating": 1,
    "date": "August 8, 2025",
    "text": "My company uses this. One of the worst UI & UX I have ever seen. The web version is good.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "b258fa09-6984-4bfe-97c2-40fd8bc1a4b6",
    "author": "damian",
    "rating": 3,
    "date": "August 18, 2025",
    "text": "buggy, weird and missing some of the features the desktop version has. otherwise, its fine",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "a2374bb2-9739-4e9b-889f-7d3f213f26c1",
    "author": "Adhi Krishna",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "They charged us unfairly. No email, no warning—just locked us out. Not acceptable.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "162b8b2d-1e2c-4015-a958-b4a8ecbb5c40",
    "author": "Bijinesh Mannil",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "Unexpected payment demands from ClickUp. No warning before deactivating our workspace.Very frustrating support response.",
    "helpful_count": 3,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "661368a3-fb8f-497d-a826-8a67590a4cf1",
    "author": "SWATHY ARAVIND",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "We trusted them, but were overcharged. Access taken away without any mail.Very bad customer support.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "33165293-ae3d-41c0-9c18-3faabbc7bd23",
    "author": "Balakrishnan Ramaiya",
    "rating": 5,
    "date": "September 15, 2025",
    "text": "Best app. This app.is very useful for me.But I forgot the password.Pl. send the old password through my email.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "5ffe94f5-fda8-4528-9cea-d912b57d093f",
    "author": "Allan Jonis",
    "rating": 3,
    "date": "September 20, 2025",
    "text": "Please adjust the notepad option, it is slow to open and bugged.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "52f8718d-390a-4857-a9d3-90fad87bbabe",
    "author": "Brian Quick",
    "rating": 5,
    "date": "September 14, 2025",
    "text": "Solid usability and straight forward design.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "7af43131-0432-4d81-a27b-8b48c2e2e1d5",
    "author": "Erik Luhar",
    "rating": 2,
    "date": "May 19, 2025",
    "text": "notification do not work as expected. push notification for reminders are silent even if settings allows sound and pop-up. and inbox do not work at all no notifications in the inbox. switching to Microsoft to do.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "020e3e68-cf56-4a6b-8200-f3a41402f459",
    "author": "Alexander Borghesan",
    "rating": 2,
    "date": "October 28, 2024",
    "text": "The desk top version works great. However, there are many bugs on the app side. Half the time clicking the create task button does not work, and when it does, it is sloppy. I am unable to access settings anymore and can't customize my view to be the calendar as default. The old app version was much better. I'm considering hoing back to google Calendar as the original appeal for me of this app was the ability to see my calendar and easily block in jobs.",
    "helpful_count": 7,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "2150631d-3f21-43d7-a62b-02a0a5590e1d",
    "author": "Andrei Dumitriu",
    "rating": 3,
    "date": "August 2, 2024",
    "text": "Ok, just started using this app with a client. It has 2 bugs that are major for me. 1. When I enter a thread on mobile (android) or iPad (iOS) it shows the initial message and the number of replies, but not the replies themselves. Several times it showed them for 2s before disappearing. I tried clicking everything to no avail. 2. I receive email notifications for everything but that setting cannot be changed on mobile. What?! Also, when clicking the link on the email to change them it goes📲",
    "helpful_count": 4,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "ac1cfe70-77d4-4a3b-b512-9a4de6829fe1",
    "author": "Giuseppe",
    "rating": 2,
    "date": "December 1, 2024",
    "text": "Ok on Desktop, but terrible on smartphone. The phone widget only shows you the daily tasks and not all the tasks you might have (google tasks is much better on that). The desktop app is okay, but the phone app is terribly managed. Insanely confusing, feels like scrolling an endless list of things, it just gives you a headache after a few minutes. At least you can it use it for free, but I basically never use it on my phone, which is a big issue for me.",
    "helpful_count": 4,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "54a6baf6-811e-4e75-bc0d-967d554fd75b",
    "author": "World changers World changers",
    "rating": 1,
    "date": "December 25, 2024",
    "text": "Wait... so you guys mean all the docs I've been working on for so long have all of a sudden vanished simply because I stopped using ClickUp for a few months? Oh wow... okay. Just a little heads up for anyone else, be careful. You might end up losing your data too. Sorry for being so aggressive, its because I'm angry 😡 and disappointed right now. I've tried to reinstall the app but nothing's changed. Even logged in from my laptop but still the same problem. Sorry, but I quit 🙌🏽",
    "helpful_count": 5,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "dcb7c327-5a0a-46bc-92b1-9f36622ebd49",
    "author": "Timothy Curnow",
    "rating": 1,
    "date": "March 4, 2025",
    "text": "The web version is ok. The Android app is truly appalling. Sorting my assigned tasks by due date, for example, puts the next four tasks in the right order, then everything else is just in a random order - due dates in July, early March, August, late March, and so on. Not being able to do something as fundamental as sort tasks in date order is an enormous failure!",
    "helpful_count": 24,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "d36ba0e3-5964-4688-b1ae-aabf85e73670",
    "author": "Kamya Kushwaha",
    "rating": 1,
    "date": "May 25, 2025",
    "text": "It's it better if I just keep hold my task for 2 sec and we get to see delete and modify option ? and delete option is not working I try to delete my completed task after 10-12 attempt it's still not deleted, that's so much frustrating and it's interfaces is so much confusion please make it bit clear and try better UX writing and that's AI icon is not even recognisable . I hope you are having better UX designer but please take a look at those pain point of the user !!!",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "b19c0af1-5ec9-4824-ae25-e7adc683896e",
    "author": "Bashir Askari",
    "rating": 1,
    "date": "October 27, 2021",
    "text": "I have no issues with a company wanting to monetize their product, I completely understand the need to do so, I'm not in a place where I can use a paid productivity tool. Click up used to have decent amount of free options. But it's getting more and more limited everyday. I've found lot of people that found themselves traped into corner by ClickUp after wasting so much time setting up something that will bear no fruit. to cut it short, I feel tricked by ClickUp with its usage limitation",
    "helpful_count": 36,
    "developer_response_date": "November 17, 2021",
    "developer_response_text": "Hey Bashir! Thank you for the review! We really appreciate the time you took to share your feedback!\n\nWe're proud to offer an industry-leading number of features on our Free Forever Plan & you would only be prompted to switch to a paid plan if you exceed the data storage limit of 100MB or consume all of your uses of certain features."
  },
  {
    "review_id": "577e7c51-14d9-4fdc-8eed-1802d4f16c45",
    "author": "Martina",
    "rating": 4,
    "date": "November 27, 2023",
    "text": "I really like how flexible and powerful this app is, plus the nice design. For the desktop version I would easily give 5 stars. But for mobile and tablet I don't understand why when opening a document I need to click once for opening and once again for editing, and the editing part takes always a bit to load. It is a bit annoying especially since I would use the mobile version to quickly add things on the go, and the double clicking plus loading kind of breaks the flow of it!",
    "helpful_count": 9,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "0f7bca38-a6f7-4299-aa73-c6adf029479d",
    "author": "Luisa Watts",
    "rating": 2,
    "date": "December 22, 2023",
    "text": "I wish it worked like it's supposed to. Their idea is amazing, but clickup fails to deliver it's service with reliability and responsiveness. It's very slow, it doesn't save/sync every time which is very frustrating. I usually use Word or Google docs to manage my documents, but since I was liking clickup so much, I decided to use their docs feature. I started to write some ideas, 2 secs later everything was completely gone (very scary). Imagine if it was days worth of work...",
    "helpful_count": 9,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "f27ab932-c0c0-426d-a447-3998fbf0cb08",
    "author": "Tamara Judge",
    "rating": 2,
    "date": "January 9, 2024",
    "text": "The browser version of ClickUp is great! But I feel like I am constantly having issues with the mobile app and it is very buggy. My main complaint is that the widget to show your task inbox no longer opens tasks. It just lists them. When I click the task expecting to view it, a box pops up and asks me which app I want to use to open the task - it doesn't give ClickUp as an option. Very frustrating when you want to quickly view more details. Please fix this issue.",
    "helpful_count": 25,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "0c3e9e68-6204-4731-bcc0-0c7bd91aa606",
    "author": "Jaime Holmes",
    "rating": 1,
    "date": "August 20, 2022",
    "text": "Email reminders are intrusive and there doesn't seem to be a way to turn them off (via app or mobile Web). Changing lists etc isn't intuitive, and can't seem to change the workspace name. Couldn't find a way to sync with my other apps after I had dismissed the initial pop up. Other productivity apps are so much more user friendly and intuitive.",
    "helpful_count": 16,
    "developer_response_date": "August 23, 2022",
    "developer_response_text": "Hey Jaime! Thanks for the review! ✨ Currently, email notifications can only be disabled from the web or desktop app. Please contact us at help@clickup.com so we can assist you with adjusting your notification settings and so we can assist you with the syncing issue you encountered. Our Support team is available anytime to help! 😊"
  },
  {
    "review_id": "2bf708e5-c669-4687-9154-f81bc9416130",
    "author": "A Google user",
    "rating": 3,
    "date": "August 2, 2019",
    "text": "I'm a paying client who is searching the world over to find something to replace Clickup because their app is just so messy.  Daily recurring tasks often get repeated a week from tomorrow. You can't sort and filter on the app.  Since I don't work from my desktop daily, my workflow has failed so many times to let me know what I was supposed to work on today because the task either didn't repeat properly or didn't show up in the app at the time I needed to see it.  I organize my daily life in order that I am going to do things. The desktop version lets me do this, the app [which I work from most often] does not.",
    "helpful_count": 36,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "3643d785-f3ed-4519-b179-61753a0a8085",
    "author": "LMV",
    "rating": 5,
    "date": "June 14, 2025",
    "text": "This app is so extremely confusing and you're in the middle of using AI for a project and just disappears and then never offered an upgrade. I have tried. I don't understand any of it. I wasted 2 hours on it and I'm done. They just throw you in there and expect you just to wander around, not knowing what to do. There's no direction whatsoever at all.",
    "helpful_count": 6,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "f88dff8b-63e4-4246-b58c-5e86f026ff45",
    "author": "Megan Fraser",
    "rating": 5,
    "date": "January 31, 2022",
    "text": "Ok so the app does not compare to the desktop, but at least it bridges the gap while on the go or away from the computer! All I can say is Clickup is the greatest thing to ever exist and it's been the be all, end all I have been searching for FOREVER 😍 Everything in one place and you never forget or fall behind again. I have never been more productive while still being calm and feeling in control! I cannot explain enough how much it has benefited my personal life and building my business!",
    "helpful_count": 15,
    "developer_response_date": "February 3, 2022",
    "developer_response_text": "Hey Megan! Thanks for the feedback!\n\nWe're so glad that you think ClickUp is the greatest! We're definitely working on improving our mobile apps & eventually they'll have near feature parity as our web app! In the meantime, please contact us at help@clickup.com so we can offer suggestions that may improve your mobile experience."
  },
  {
    "review_id": "557a9d49-3f8a-460f-a70b-77dcaa78da8a",
    "author": "Antonis Politis",
    "rating": 1,
    "date": "January 15, 2023",
    "text": "The way they make you buy premium is DISGUSTING. They don't give you enough information when using features that seem free, and then after a certain usage limit the HIDE & BLOCK all of your work, making you buy premium to see it again. Then the minimum charge is 276€, forcing you to buy it for 5 members (no other option). If you are a small team or early stage startup, NEVER USE CLICKUP.",
    "helpful_count": 5,
    "developer_response_date": "January 17, 2023",
    "developer_response_text": "Hey Antonis! Thank you for the review! 🌻 We're sad to hear that you had a negative experience, but we'd really like to change that! Please contact us at help@clickup.com so we can look into plans and pricing options that might help. Our Support team is available anytime to help!✨"
  },
  {
    "review_id": "29565393-bb3c-47e0-b697-df8012350f63",
    "author": "Laura Barrett",
    "rating": 1,
    "date": "September 23, 2023",
    "text": "BEWARE OF BILLING PRACTICES! I foolishly signed up for a higher tier cause they offered me a deal. I foolishly forgot to cancel before they charged me at full price upon renewal. BUT I went to cancel the subscription but continue to use it for the period of time I paid for it ($199 for the year) but no. You can't cancel you can only downgrade and it is effective immediately! They count on the fact you will forget or not be willing to forfeit money. There are a lot better options out there...",
    "helpful_count": 21,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "3b8acf87-3e31-49c3-abf8-70094d394e43",
    "author": "James G (Bojkenoven)",
    "rating": 2,
    "date": "April 7, 2025",
    "text": "This app is so broken that it'd be less painful to write in my own blood on a page that's actively on fire. Literally nothing loads when I select through spaces. No lists, no comments, nothing. it just fills my screen with grey loading bars and never loads anything. I've tried rebooting, reinstalling, re-signing in and out. Nothing. Data is fine, connection is fine! I even tried on a separate Android device and nothing. 2 stars, because at least it works on the Web and desktop!",
    "helpful_count": 9,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "7fb6e43e-dc85-44a2-b888-2c6a0793c14d",
    "author": "Lloyd",
    "rating": 3,
    "date": "January 31, 2021",
    "text": "This is promising! It's early days but I like the structure and simplicity. It's basic and really just in beta but it's going in the right direction. If you could view docs as well it would be pretty much all I would need it for to provide on-the-go reference. Although I had to uninstall for now as it hijacks any browser clicks relating to the bugs/features 'canny.io' forum meaning you can't access it. I look forward to rating 5 stars in a few months.",
    "helpful_count": 3,
    "developer_response_date": "February 1, 2021",
    "developer_response_text": "Hey, Lloyd! Thanks so much for sharing your feedback with our team! Eventually, the new app will have near feature parity with our web app, but with all the dynamic features we've built for ClickUp, it will take time. You can check out our public roadmap to see what is coming up next! Also, we do have the Doc view available on the mobile app! 🤩"
  },
  {
    "review_id": "1e88132d-d519-4f58-b775-3fa93bab8d3d",
    "author": "Liane Silva",
    "rating": 2,
    "date": "May 3, 2023",
    "text": "The desktop app is brilliant. The mobile one, however, not so much. Not only it lacks a lot of the desktop functionalities, but also it has very different views and interface options for the same functionalities it shares with the desktop app, and it's buggy, it crashes often, and it's slow. Unfortunately, I'll have to use it for checking some of the info I have on there on the go, but it's a long way from being a useful actual replacement of the desktop version.",
    "helpful_count": 25,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "4f9567df-acd3-471c-8d38-38c22baf8575",
    "author": "Kevin Holtzhausen",
    "rating": 1,
    "date": "April 4, 2024",
    "text": "Recently started working on the desktop version, which looks very good. Tried this app, and it is terrible. Dashboards don't populate correctly, all data not displayed, no 'add card\" icon orf button as per the widget description. I don't think this app is worth it. Still testing the Web based version to see if it is worthwhile for me and our team.",
    "helpful_count": 29,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "8a26dbe4-c1fb-485a-9839-7a95e7c56e3e",
    "author": "M K",
    "rating": 4,
    "date": "July 19, 2021",
    "text": "Decent overall including the support. It is just that the \"Everything\" space doesn't show any tasks in the Boards view (but works with the List view), until I changed some filters from the webapp, I'm not sure if that was a coincidence. Also, widget should show overdue and next 7 days at least, not only today's inbox. Also comment syncing isn't perfect. I still believe they are much better than Asana for me, and their phone app feels like a native app now and easy.",
    "helpful_count": 15,
    "developer_response_date": "July 19, 2021",
    "developer_response_text": "Hey, there! Thank you so much for your feedback! We're so glad that you think the app is easy and better than Asana!😊 We're sorry that you've run into some issues while using the app, but we'd love to help! Could you please message us at help@clickup.com so we can look into this further and try to find a solution? 🙂"
  },
  {
    "review_id": "4c3c978d-48cb-4739-ac36-3cd131406020",
    "author": "Ash Turner",
    "rating": 3,
    "date": "February 6, 2025",
    "text": "I like the concept of the app; I think it would be very beneficial to those in teams or who want multiple features to enhance your productivity. Bit too overwhelming for me. Although, when I tried to delete my account (multiple times), there's an \"error\" despite doing everything correctly. Very suspicious. I will be having to contact support, which is not ideal at all.",
    "helpful_count": 3,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "c99e795b-bac2-4e4b-85c4-6975ecc06426",
    "author": "Ivan Yeh",
    "rating": 1,
    "date": "April 26, 2025",
    "text": "Love Clickup desktop, but this app is the worst. Bugs reported and accepted over a year ago never got fixed. My favorite features were removed over time. New features are often introduced in half baked buggy state. Favorite tasks don't sync with desktop. LineUp feature literally asks user to use desktop. The worst part is the updates often change Home UI on a whim, breaking my workflows and cause loss of productivity.",
    "helpful_count": 31,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "e5de879e-fba7-46ab-808f-7dcaa586a31c",
    "author": "Rubén Godoy",
    "rating": 1,
    "date": "May 13, 2025",
    "text": "Pretty bad experience with the Pixel 8 Pro. The app frequently crashes, and the keyboard does not work most of the time in the chat. It is almost impossible to use.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "52398949-7074-4299-9a22-e8996c90b164",
    "author": "Sony JOSEPH",
    "rating": 2,
    "date": "May 9, 2025",
    "text": "This is not a purely APP based application.... we have some some expectations after reading your \"About Section\" but it's the same... we get the same lousy interface and lagging and logging issues...",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "1ea8aaec-d280-4061-8cb9-550fe110e609",
    "author": "Francisco Díaz",
    "rating": 2,
    "date": "January 17, 2023",
    "text": "Very invasive emails. I wanted a todo list/productivity app and decided to try Clickup. Turns out I ended up not going for it (the app is good, but I needed something with a widget that showed my tasks). Even after deleting my account and unsubscribing from email communications (separately) I have kept receiving daily emails from them. I guess it's part of the onboarding email program. I don't want help Clickup. I want you to stop spamming my inbox.",
    "helpful_count": 2,
    "developer_response_date": "January 20, 2023",
    "developer_response_text": "Hey Francisco! Thank you for the feedback! 🌻 We're sad to hear that you had a negative experience & that you no longer use ClickUp, but we really want to help you unsubscribe from our emails. Please contact us at help@clickup.com so we can investigate the issues you experienced & find a resolution. Our Support team is available anytime to help!✨"
  },
  {
    "review_id": "fd9bc21d-1729-4bf5-a3a7-4b70c3230382",
    "author": "Ricardo Riveros",
    "rating": 1,
    "date": "May 21, 2025",
    "text": "Just installed on my pixel 9 pro and it's always crashing. Would be nice to have Gantt chart view even if we have to zoom in and out. The web app is still the best experience.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "91b9cebb-c3b5-4109-ae17-c4800477a5a5",
    "author": "Ryan W (Platonic, Unc0nnected)",
    "rating": 1,
    "date": "May 10, 2025",
    "text": "this app is completely unstable and almost unusable. it crashes constantly, the keyboard goes away and comes away,. It's better than nothing but holy cow. does this thing speak volumes of one of the worst organized mobile software development teams on the planet to devoid completely both any sort of QA process",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "155e21c5-52fd-47cc-bfc5-02491d08a4ff",
    "author": "レイズ",
    "rating": 1,
    "date": "November 17, 2023",
    "text": "Unusable. After installing and successfully logging in, it is stuck on the loading screen. I tried clean installations multiple times, even clearing data and cache, but the issue persists. UPDATE: It was already working until the update for ClickUp Mobile 3.0. When enabled, nothing is showing except for the tasks. When you click on the task, nothing is shown. Basically, it's unusable again.",
    "helpful_count": 24,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "4bfab5b5-7971-493c-970d-64836edb29a6",
    "author": "Patrick Kofler",
    "rating": 3,
    "date": "February 21, 2022",
    "text": "GOOD: Limited features (compared to web) and in return is more streamlined. BAD: Not very robust. Recently, there is no bottom navigation bar anymore, but a hamburger menu. Disadvantages: 1. Before clicking, I don't know what is in the hamburger menu. In the bottom navigation bar, the options are immediately apparent. 2. Instead of being able to navigate with one click on the element in the bottom navigation bar you have two clicks (open hamburger menu and click on menu element). = Doubling",
    "helpful_count": 7,
    "developer_response_date": "February 28, 2022",
    "developer_response_text": "Hey Patrick! Thank you for the review!💫 The mobile app will eventually have near feature parity as our web app. See what's coming next on our mobile roadmap! In the meantime, we love hearing ideas for improvement & we'd love for you to share your suggestions on our feedback boards. That's the best way for your ideas to be considered!🚀"
  },
  {
    "review_id": "8ac58d2a-4e27-430e-8eaa-733f531f834e",
    "author": "Tina Shaw",
    "rating": 2,
    "date": "May 25, 2025",
    "text": "ClickUp app was great but totally unusable now. Totally messes up my system every time I use the app, can only use the desktop version now. I really hope they fix this app.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "89660303-e4f0-44ea-8871-e74cf22179fd",
    "author": "A Google user",
    "rating": 2,
    "date": "March 12, 2019",
    "text": "I had a play around with the web version of the application and loved it, it seems really powerful. Unfortunately, as a few others have commented, that level of finish is lacking in the mobile app.  To name just two quickly noticed omissions in the app are the ability to create repeat tasks and no documentation for using the mobile app.  Some posters have commented about a 2.0 coming out, I REALLY want it to work as I love the web version but the lack of a usable app version rules it out for me.  If I could ask for one additional thing it would be the incorporation of two-factor authentication in the free plan.",
    "helpful_count": 24,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "bf882427-6dd7-414d-acc1-19006e17d327",
    "author": "Co “Cobarg” barg",
    "rating": 1,
    "date": "January 5, 2022",
    "text": "What a weird system. You install the app, need to put in email to register. Then get a meil to click the verification link and are redirected to a button to open click up via the app. The last button redirects to the playstore again, where you see that you have installed the but cannot open it. If you open the app instead, it asks for registration email again... There is no way to start the program on my device because it sends me back and forth. Too bad, I was hoping to make good use of it.",
    "helpful_count": 20,
    "developer_response_date": "January 5, 2022",
    "developer_response_text": "Hey there! Thank you for the feedback!\n\nPlease email us at help@clickup.com so we can look into the issue you experienced and get the problem resolved. Our Customer Support team is available 24/7 to help!"
  },
  {
    "review_id": "d5b7e4af-7356-4160-8729-cf0f2d40c462",
    "author": "Misbachul Munir",
    "rating": 1,
    "date": "July 11, 2025",
    "text": "I pay full year but can't access all the features on mobile. Disappointing",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "84191a80-9f52-4638-b0c2-3f1f55a067dc",
    "author": "Anishma Subash",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "They asked us to pay without a proper bill. Very bad service.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "6d3256af-644f-4db5-a69a-bde680770ccc",
    "author": "Ragman Shrestha",
    "rating": 1,
    "date": "July 4, 2025",
    "text": "clickup app is insanely bad. search function doesn't work. all of the boards that i created doesn't show up",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "794cb92f-d50b-43a6-a5d2-21b1616448da",
    "author": "Jithin ashokan",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "They asked us to pay without a proper invoice.Support service was terrible.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "3d561795-e63e-4630-a47a-e1fe55b6ccf4",
    "author": "Fasna Yazin",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "Billing feels dishonest. No proper communication .We don’t recommend ClickUp.🫤",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "8212d392-397e-4639-8a8b-11ba32d742f8",
    "author": "Smitha Ashokan",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "Payment request without clear billing.Support gave no useful answers",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "4b83f580-4100-4bbe-84e1-89541da434be",
    "author": "Franky",
    "rating": 1,
    "date": "September 3, 2025",
    "text": "The desktop version works flawlessly, but the mobile app is one of the most frustrating I’ve ever used. The onboarding and login process—the very first step for users—is buggy, slow, and the OTP verification system is a complete mess. i had to uninstall because I'd rather just wait and use it with my desktop than this joke of an app. This app feels like it was outsourced.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "ff36a399-4018-472a-a02d-84d975a0f328",
    "author": "Chavarous Kennebrew",
    "rating": 3,
    "date": "April 30, 2025",
    "text": "Widgets have never worked for me. I can add one to a screen but have to continuously login. The tasks are not displayed until that is completed regardless of the amt of times I login.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "33264fcd-9acf-42c3-a769-78ebc0e2a5ec",
    "author": "Andrei Polkanov",
    "rating": 3,
    "date": "December 16, 2023",
    "text": "Let me share my 2min user experience on Android device: 1. The app was installed. 2. Welcome cards were read (the most part of describing usage). 3. A needed task was found and opened. 4. Web links in the task wasn't clickable even after unfolding the description - FAIL. 5. I went to the browser version to reach the links from there - it wasn't possible to get into the web version as the app was already installed - FAIL. 6. I had to uninstall the app to reach the links from the web - MEGAFAIL.",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "f4dabeee-5148-4576-82e4-935ca24fcfc6",
    "author": "Maciej Lunitz",
    "rating": 5,
    "date": "April 25, 2025",
    "text": "Very nice look, impressive. Simple, not overwhelming, but monster under the hood! Showcase right on point for beginners",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "9f053413-8971-4513-9d30-ea8c72458a99",
    "author": "John Cabasug",
    "rating": 1,
    "date": "June 10, 2025",
    "text": "Doesn't work on ROG with the latest Android version. Got a screenshot of 3 clickup apps due to recent attempts to logging in. Too much feature emails, basics neglected.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "d33dc065-db38-447b-81e8-e7c5c91a836d",
    "author": "Shahzaib Ameen",
    "rating": 2,
    "date": "June 29, 2025",
    "text": "It was working very well before the recent update, but now it's quite buggy. Lists won't open properly, and the UI/UX seems to have taken a step backward.",
    "helpful_count": 3,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "30393f16-add4-4cc9-bca4-1d5c28638f9f",
    "author": "Natalie Mejia",
    "rating": 5,
    "date": "May 23, 2025",
    "text": "Super easy to stay organized on mobile and pc. I can keep track of everything on one spot and not need to transfer notes or ideas.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "ca724a3e-e3c7-4b44-9b2f-d34de33ea220",
    "author": "Ujval Joshi",
    "rating": 1,
    "date": "June 1, 2025",
    "text": "Paid for 1 year account. Wasnt using enough so downgraded account after 2 months. now they take money for 1 year and not allowed to use product. How this is not scam.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "528304d9-16ab-4ab9-aab2-2b71ee9caf74",
    "author": "Chris Kranz",
    "rating": 1,
    "date": "May 15, 2025",
    "text": "horrible, was it even tested? it's basically unusable, it's so poorly designed that half the buttons you think you need aren't there, or are hidden under a dialogue or something else.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "5d85e7d7-042b-4e41-a491-e5c41d90da39",
    "author": "narendra adinugraha",
    "rating": 2,
    "date": "May 4, 2025",
    "text": "After setting a task to recur and save it, next time I open the task, the recurrence setting that I already set is gone. it's annoying",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "12ebc428-5c31-4f86-a5fe-58be200611fc",
    "author": "Albeth Jane Beñas",
    "rating": 3,
    "date": "May 22, 2025",
    "text": "I have use the help options to integrate my calendar but Its not helping. It would be great if the integration option is more straightforward.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "d56f0a06-c0e7-41c4-a8d3-f5b242f9e7ec",
    "author": "AbdulHannan Bhogani",
    "rating": 3,
    "date": "June 25, 2025",
    "text": "slow and moderately confusing, should've done categorization . no project section although the team member just changes the project but I am not able to see in the mobile app . very time taking for api responses.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "683cf40f-cd8c-4ba7-a06d-e8e82b0f9a37",
    "author": "Nat Marshik",
    "rating": 3,
    "date": "June 26, 2025",
    "text": "functionality for notifications and commenting is good. glitchy with audio comments. the my work view is not currently usable and does not correspond to the updated my work View in 3.0",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "5907fb25-a448-4b63-8d58-42c095825ea1",
    "author": "F C",
    "rating": 2,
    "date": "June 5, 2025",
    "text": "very complex, poor support docs - just get to the point! you have to navigate pages and pages of circular self congratulary drivel to get basic answers. so over bloated. support chat v slow, or none.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "06457c72-4905-40dd-8b02-0b462aea6954",
    "author": "rafit Chy",
    "rating": 5,
    "date": "May 2, 2025",
    "text": "Great app. Please add an in-app notification reminder for the tasks. A persistent alarm type notification will help to remind the tasks.",
    "helpful_count": 1,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "a1e83dde-03ed-4eb7-ad1e-bca959a103b8",
    "author": "Bryan Plays",
    "rating": 5,
    "date": "June 4, 2025",
    "text": "It's a good app which I have been using currently. I am a student and when I started to use this my productivity increased by a long shot. Thanks and Regards",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "9380a8e4-df87-45c1-9d5d-02a4cb39d57f",
    "author": "J C",
    "rating": 1,
    "date": "September 15, 2025",
    "text": "Too Complicated & Widget Doesn't Show Anything Quire would be ideal if it weren't so buggy (like catastrophic fail buggy) so I tried this app, but it took too long to find where my new task ended up and too long to figure out how to mark a task as complete. The screen area I have to hit with my finger to pull up the correct menu to complete a task is tiny. Quire has you long-swipe right. Still looking for the task app which can simply let me list tasks, nest them, and complete them.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "d8051143-a741-4905-b1a7-a9039f4f51b7",
    "author": "Meng-Isaac Yang",
    "rating": 2,
    "date": "May 28, 2021",
    "text": "Potentially great apps, but still got many to improve. The PC version great, while Android is under developed. Basically all functions based on your click up platform, means he you want to add a photo to your task, you have to open your click up apps, choose the task for editing, then add the photos. But usually we browse via our gallery, choose anything useful and share to our apps. Same problem for sharing files and videos. Maybe can improve from your next updating?",
    "helpful_count": 16,
    "developer_response_date": "May 29, 2021",
    "developer_response_text": "Hey, there! Thanks for the review! The new app was released with a limited set of core features to get them into your hands faster! Eventually, the new app will have near feature parity with our web app, but with all the features we've built for it will take time. I would love to invite you to Canny to leave this as a feature request though! 🚀"
  },
  {
    "review_id": "c138d4ef-a510-4a4c-80a3-e5e620846c69",
    "author": "D R",
    "rating": 4,
    "date": "November 28, 2024",
    "text": "Still getting the hang of it, but it seems fairly complete and overreaching! Has just about everything I need & more, still exploring! My only little quirk so far has been the missing of the possibility of dumping images inside Kanban boards Trello style, but the rest has been pretty cool! I will give it a shot with a subscription to see how things evolve! 👍",
    "helpful_count": 68,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "944dae8a-676c-45ef-8716-bde1bcd2b146",
    "author": "Muhammad Adil",
    "rating": 1,
    "date": "July 8, 2025",
    "text": "Still getting notifications, after turning off",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "2ec56d3a-3c9b-4de1-a69b-584c5065e657",
    "author": "jinu kj",
    "rating": 1,
    "date": "July 30, 2025",
    "text": "Unexplained charges on the bill. ClickUp has lost our trust.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "016624ca-6567-47fe-b17e-de61c6f03bf5",
    "author": "Clockworks Event Management",
    "rating": 4,
    "date": "September 9, 2021",
    "text": "I love ClickUp, I really do. And I tried some - Asana, Trello, Zoho, Monday, etc. but I personally enjoy ClickUp more. And I love the desktop app. The mobile app though is a bit buggy. When I add tasks and try to refresh the home page, it doesn't show the new tasks created. Had to exit the app and then open it again, that's when it'll pop up. I also wish there's an option to get each task markers from different lists color coded just like in the desktop app. In her, it's just gray.",
    "helpful_count": 17,
    "developer_response_date": "September 14, 2021",
    "developer_response_text": "Hey there! Thanks the review!✨ We're so glad that you love the desktop app & we're definitely working on improving our mobile app!📱 Eventually it will feature the same capabilities of our web app! Check out our roadmap to see what's coming up next! In the meantime, please email us at help@clickup.com so we can fix the task issues you mentioned!🛠"
  },
  {
    "review_id": "8ab3f983-5c52-4258-899d-51922317ce9a",
    "author": "Dror H",
    "rating": 1,
    "date": "January 20, 2022",
    "text": "Clickup is a good product but the performance issues are not acceptable. Our entire team can't work for days because Clickup is either down or extremely slow. All while the status page shows that there aren't any problem. You'll find many other customers facing the same issue. Ive tried to reach Clickup for days. No response. No refunds (we pay over $100 for their service). Please focus on reliability first, then ship more features.",
    "helpful_count": 9,
    "developer_response_date": "January 21, 2022",
    "developer_response_text": "Hey Dror! Thanks for the review!\n\nWe're sorry for any inconvenience the recent outage caused you. Our engineers worked 24/7 to resolve the issue & they're actively working on prevention efforts for the future. We were delayed in replying to users due to the increased message volume, but every message received was responded to as soon as possible."
  },
  {
    "review_id": "cfef80a5-f711-480f-83f9-2d640b4ebe5a",
    "author": "dj silver",
    "rating": 3,
    "date": "July 22, 2021",
    "text": "Update: you finally fixed the issue when clicking on a notification it actually loads that item and displays it. Love clickup use it for everything daily and recommend it to everyone. The mobile app just doesn't work, clicking a task from notifications nothing shows up, get invalid token errors, clicking from email nothing loads.... can't find anything. Had to uninstall the app just so I could use the mobile web version and work again.",
    "helpful_count": 21,
    "developer_response_date": "July 22, 2021",
    "developer_response_text": "Hey, there! Thanks so much for the review, and feedback! 🙌 We're sorry to hear you're experiencing these issues. If you'll send an email to help@clickup.com, we'd love to help! 🙏"
  },
  {
    "review_id": "f4a12425-7904-4fbf-a66f-b3bdd12b3ef1",
    "author": "David Poulet",
    "rating": 2,
    "date": "January 1, 2023",
    "text": "The service itself is great, but the mobile app is a bit mediocre. It's the one thing about clickup that has me thinking about alternatives. The main issue is lack of customisability. For issuance when you open the app the home page shows all tasks grouped by due date. No option to change that or display anything else. I don't use due dates to prioritise so the home page is full of empty groups. These are small things but put me off using it.",
    "helpful_count": 18,
    "developer_response_date": "January 11, 2023",
    "developer_response_text": "Hey David! Thanks so much for the feedback! ✨ We're actively working on improving our mobile apps & eventually they'll have near feature parity as our website. Keep track of what's coming next on our mobile roadmap. In the meantime, logging into ClickUp from the web browser on your mobile device may improve your experience. 💫"
  },
  {
    "review_id": "0688935f-766d-4dc7-8411-69de063b39d3",
    "author": "Josh Bryant",
    "rating": 3,
    "date": "July 20, 2022",
    "text": "Good app but can be better. It lacks the reliability that one would expect from a productivity platform. I don't want to have to check every time I do something in the app that it has actually done it (synchronisation issues). If I make a mistake when setting statuses properties, sometimes it tells me only after I try and save my changes. It reports something is invalid and I have to start all over again. Very frustrating. I hope the app will lean closer to \"powerful\" rather than \"simplistic\".",
    "helpful_count": 21,
    "developer_response_date": "August 10, 2022",
    "developer_response_text": "Hey Josh! Thanks for the feedback! 🙌 We really want to help! Please contact us at help@clickup.com so we can investigate this and get the problem fixed.🛠 Also, feel free to share your any improvement suggestions you have on our feedback boards! Our Product team reviews every post and that's truly the best way for your ideas to be considered!🌟"
  },
  {
    "review_id": "0bd2e911-186b-44f9-895a-4f2bfd3d1adc",
    "author": "Michael",
    "rating": 2,
    "date": "November 1, 2024",
    "text": "The mobile app needs serious fixes. Major issues: Notifications lead to empty pages even after refresh, making it impossible to track team updates. Mobile search doesn't work properly - can't find existing tasks. Desktop version works well but runs slower than expected. Not reliable enough for professional use on mobile. Come on Clickup team you can do it!",
    "helpful_count": 2,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "cf4a43c0-d5b2-4b55-9194-647522cc0365",
    "author": "Sarah E.",
    "rating": 3,
    "date": "January 12, 2022",
    "text": "I looove the tool and the app is handy, but I'm missing a way to choose which list shows first when I open the app, and when I want to edit descriptions of tasks, it loads forever and doesn't open on my android phone. That makes it hard to use. If that's fixed, it's a 5 star game changing app. Thank you, ClickUp.",
    "helpful_count": 5,
    "developer_response_date": "January 12, 2022",
    "developer_response_text": "Hey Sarah! Thank you for the feedback!\n\nPlease email us at help@clickup.com so we can look into the loading issue you experienced and get the problem fixed. Our Support team is available 24/7 to assist help!"
  },
  {
    "review_id": "f8c7c0bf-1c2a-452a-9bd3-2fb479513dc6",
    "author": "Grace Lbng",
    "rating": 2,
    "date": "July 9, 2023",
    "text": "I love how you can integrate Google Calendar with the application (clickup to gcal and gcal to clickup). Unfortunately, many of the app's features are non-functional when offline which is a deal breaker. I personally like to see tasks in spaces and in the calendar regardless of connectivity (in offline mode, it shows \"Connection Error\"). Additionally, reminders only show when connected to the internet as well, which sucks because I don't have connection all the time. On to the next app, I guess!",
    "helpful_count": 17,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "21017dcd-b19c-4829-9663-7459d22d2ffd",
    "author": "Patchitrakaar Anupam",
    "rating": 4,
    "date": "July 29, 2025",
    "text": "It's a great app to be on a single page in an organization.",
    "helpful_count": 0,
    "developer_response_date": null,
    "developer_response_text": null
  },
  {
    "review_id": "02b6ae95-8a87-47b2-8f81-4b555c8a2bd0",
    "author": "Tore Rex",
    "rating": 2,
    "date": "April 3, 2021",
    "text": "2 stars for not crashing. Probably one of the the most confusing project management tools I've tried. Things are very hard to find. Tasks dissappear once finished. Chats gone. Chat messages not showing up in notifications in the app. No push notifications. To get messages turn email notifications. Once you get the email, tap it and most of the times you end up in the vicinity of the message. You still have to find the actual message in the app. I'll stick to Trello and Slack",
    "helpful_count": 12,
    "developer_response_date": "April 6, 2021",
    "developer_response_text": "Hey, Tore! Thank you for the review! The ability to filter for archived tasks is planned to be added this month!🚀Be sure to checkout our mobile roadmap for more information. Next, for your issue with notifications. We would love to troubleshoot this for you! Would you mind sending an email to bugs@clickup.com? That way we can investigate this!"
  },
  {
    "review_id": "64530902-e877-42da-872c-71426d2a6ace",
    "author": "Andrei Gramakov",
    "rating": 3,
    "date": "November 22, 2021",
    "text": "The app is buggy. Sometimes cannot update the description, sometimes cannot see some control elements. What is more important, the app is narrowing the functionality of the ClickUp service. The service is awesome, the app does not provide the ability to work with it. No dependencies (cannot find), no documents from the sidebar, no commands from the chat and so on. I hope the company will focus on it some time soon.",
    "helpful_count": 6,
    "developer_response_date": "November 30, 2021",
    "developer_response_text": "Hey Andrei! Thank you for the feedback!\n\nWe're definitely working on improving the mobile app & eventually it'll have near feature parity as our web app. In the meantime, please email us at help@clickup.com so we can investigate and find a resolution for the the buggy issues you experienced. We're available 24/7 to help!"
  }
]