[
  {
    "name": "Roger Hall",
    "rating": "5 stars",
    "text": "Both photos below were taken on the new Google 10 Pro just minutes apart and unedited (except for the white dot in the middle of the first one) to depict the location of the second picture. The first picture with no zoom and the second with full zoom of the house a mile away. Best cell phone camera I have seen to date!!!!!!",
    "date": "a week ago"
  },
  {
    "name": "Manuela T.",
    "rating": "2 stars",
    "text": "So disapointed! Everywhere in the internet is marked that there is a Google Store (similar to Apple) but no, here is absolutely nothing for public - even the water in the public toilet did not work. My family just told me to sell my android …",
    "date": "2 years ago"
  },
  {
    "name": "Abby Finton",
    "rating": "1 star",
    "text": "MAKE TURNING OFF AI AN OPTION or we’re all moving back to a different browser id take yahoo over this annoying update. Either get rid of the ai because it’s always wrong anyways, or LET US TURN IT OFF",
    "date": "2 weeks ago"
  },
  {
    "name": "Dale Hulst",
    "rating": "1 star",
    "text": "Google's poor implementation of Google TV and removing access to Youtube Kids via the Childs account is another glaring oversight by this company.  Not good enough.",
    "date": "2 weeks ago"
  },
  {
    "name": "van nguyen",
    "rating": "1 star",
    "text": "Worst customer service EVER. Hands down. They make Comcast look like Angels. To this day, I still have not received the help I needed from them.",
    "date": "2 weeks ago"
  },
  {
    "name": "Shreez",
    "rating": "5 stars",
    "text": "It is the headquarters of Google.\n\nWhich is helping me right now to write this review. …",
    "date": "3 weeks ago"
  },
  {
    "name": "Kate Shao",
    "rating": "5 stars",
    "text": "Love this company! Even though visitors cannot enter their office, but you can enjoy the awesome and beautiful outdoor area. It's pretty cool that sometimes you also can see some employees do exercise in the area.",
    "date": "7 years ago"
  },
  {
    "name": "Ishwor Bhusal",
    "rating": "5 stars",
    "text": "A different world, completely unique experience, place where someone doesn't like to come out after entering into the campus.\nGood Headquarters, Mountain View (Silicon Valley), California, United States of America",
    "date": "6 years ago"
  },
  {
    "name": "Okan S",
    "rating": "5 stars",
    "text": "Amazing and welcoming google complex in Silicon Valley. It is open to public. You can take a colourful google bike for free and take a tour in the campus. You can feel the philosophy of google in the campus which encourages its employees to …",
    "date": "8 years ago"
  },
  {
    "name": "Alam Shaikh",
    "rating": "5 stars",
    "text": "What a superb campus, the towers are named after years which seems a cool idea.\nThe whole campus is clean and googles finds their way with beautiful small small gardens. …",
    "date": "7 years ago"
  },
  {
    "name": "Carla Benavides",
    "rating": "1 star",
    "text": "Horrible treatment. Person at googleplex out of the blue told me: HEY MA’AM - YOU CANNOT GO INTO ANY BUILDING.\nThen I asked, can I use the bikes to explore around? …",
    "date": "a year ago"
  },
  {
    "name": "Bienvenida nguema",
    "rating": "1 star",
    "text": "I have a business account with Google and it is supposed to be inactive, how is it possible an inactive account but I see the money go up every day in this same account who is going to pay it, I created a business account for my small …",
    "date": "2 weeks ago"
  },
  {
    "name": "Steven Gutierrez",
    "rating": "3 stars",
    "text": "Fun corporate HQ to visit.\n\nSet across lots of buildings and well prepared for tourists. …",
    "date": "8 years ago"
  },
  {
    "name": "Nia, Lens Go",
    "rating": "5 stars",
    "text": "Sprawling campus with lots of greenery and park like  atmosphere. Visitors can not enter but can spend time touring and enjoying the beautiful outdoor areas or watching the outdoor employee fitness classes. Friendly security staff. Love this company!",
    "date": "7 years ago"
  },
  {
    "name": "Gary Pugh",
    "rating": "1 star",
    "text": "Someone is getting into my bank account from you.Better take care of it or it's going to get ugly there.",
    "date": "2 weeks ago"
  },
  {
    "name": "Goesto Restaurants",
    "rating": "3 stars",
    "text": "It's a beautiful place but you can't go in anywhere! I would have loved to grab some food, buy some merchandise, or whatever, but everything was closed to the public. …",
    "date": "3 years ago"
  },
  {
    "name": "Nicolas De Smyter",
    "rating": "4 stars",
    "text": "Very fun location to visit. There are a lot of different things to see here, but the most interesting thing here, is to talk to one of the Google'rs and ask what they have to say. Mainly because then you can here things about the Googleplez that is really interesting but isn't officially shared.",
    "date": "5 years ago"
  },
  {
    "name": "Henrike Scharnhorst",
    "rating": "3 stars",
    "text": "Cool to be able to say that you visited the Google Campus. But there isn’t really much to see if you don’t work there. The gift shop is quite okay if you like Google / Android.",
    "date": "5 years ago"
  },
  {
    "name": "Andras Herceg",
    "rating": "5 stars",
    "text": "I was only outside at the weekend. I couldn't skip the Android park:) At that time the Ice Cream Sandwich was the newest version. We took the Google-bus to the train, the driver was a nice helpful guy.",
    "date": "8 years ago"
  },
  {
    "name": "DJ H",
    "rating": "5 stars",
    "text": "Google is one of my favorite companies hands down. No other company has given so much control and free information at their fingertips. On a morning walk around my neighborhood, I saw a Google Street View vehicle. Therefore I decided to …",
    "date": "7 years ago"
  }
]